In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("E:\\Innomatics\\data\\loandata.csv")

In [3]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

## Groupby


Pandas `dataframe.groupby()` function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names.

In [ ]:
df.groupby(by=grouping_columns)[columns_to_show].function()

In [13]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

In [4]:
df.groupby(by = "Gender")["ApplicantIncome"].mean()

Gender
Female    4643.473214
Male      5446.460123
Name: ApplicantIncome, dtype: float64

In [14]:
df.groupby(by = "Education")["ApplicantIncome"].mean()

Education
Graduate        5857.433333
Not Graduate    3777.283582
Name: ApplicantIncome, dtype: float64

In [5]:
df.groupby(by = "Gender")["ApplicantIncome","LoanAmount"].mean()

C:\Users\USER\AppData\Local\Temp/ipykernel_1008/909976339.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(by = "Gender")["ApplicantIncome","LoanAmount"].mean()

        ApplicantIncome  LoanAmount
Gender
Female      4643.473214  126.697248
Male        5446.460123  149.265957

In [6]:
df.groupby(by = "Gender").mean()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
Gender,,,,,
Female,4643.473214,1108.008929,126.697248,352.293578,0.831683
Male,5446.460123,1742.932352,149.265957,339.665272,0.847007

In [7]:
df.groupby(by = ["Married","Gender"])["ApplicantIncome"].mean()

Married  Gender
No       Female    4503.787500
         Male      5236.146154
Yes      Female    4829.645161
         Male      5529.540616
Name: ApplicantIncome, dtype: float64

In [ ]:
# using multiple columns
df.groupby(by=['Gender','Married']).mean()

In [8]:
import numpy as np

In [9]:
df.groupby(['Gender','Married'])["Gender"].agg([np.count_nonzero])

                count_nonzero
Gender Married
Female No                  80
       Yes                 31
Male   No                 130
       Yes                357

In [10]:
df.groupby(['Gender'])['LoanAmount'].agg([np.mean, np.std, np.min, 
                                            np.max])

              mean        std  amin   amax
Gender
Female  126.697248  79.286460   9.0  600.0
Male    149.265957  82.810851  17.0  650.0

Note that df.groupby returns a DataFrameGroupBy object.

In [11]:
df1=df.groupby(['Married',"Gender"])
type(df1)

pandas.core.groupby.generic.DataFrameGroupBy

In [12]:
df1["ApplicantIncome"].mean().sort_values()

Married  Gender
No       Female    4503.787500
Yes      Female    4829.645161
No       Male      5236.146154
Yes      Male      5529.540616
Name: ApplicantIncome, dtype: float64

In [8]:
a = "11.1"
if a > "10":
    print(a)

11.1